{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_input"}, "name": "user_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "movie_input"}, "name": "movie_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "user_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 944, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "user_embedding", "inbound_nodes": [[["user_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "movie_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 1683, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "name": "movie_embedding", "inbound_nodes": [[["movie_input", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "FlattenUsers", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "FlattenUsers", "inbound_nodes": [[["user_embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "FlattenMovies", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "FlattenMovies", "inbound_nodes": [[["movie_embedding", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "Simalarity-Dot-Product", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "Simalarity-Dot-Product", "inbound_nodes": [[["FlattenUsers", 0, 0, {}], ["FlattenMovies", 0, 0, {}]]]}], "input_layers": [["user_input", 0, 0], ["movie_input", 0, 0]], "output_layers": [["Simalarity-Dot-Product", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}